run/labReactor/labReactor/0.orig/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 ${${FOAM_CASE}/caseDict!Uinlet} 0);

boundaryField
{
    inlet
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  ${${FOAM_CASE}/caseDict!volumetricFlowRate};
        profile             laminarBL;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           $internalField;
    }
    wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
