run/labReactor/labReactor/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
    }
    outlet
    {
        type            prghTotalPressure;
        // rho             rho;
        // psi             none;
        // gamma           1.4;
        p0              $internalField;
        value           $internalField;
        U               U.gas;
    }
    wall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
    }
}

// ************************************************************************* //
