run/labReactor/labReactor/0.orig/Y.solids.template
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          TO_BE_SET_BY_setICBC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/../../../src/common/getCorrespondingMassFraction" // [-] - Mass fraction of the specie FoamFile/object

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform $OUTPUT_getCorrespondingMassFraction;

boundaryField
{
    inlet
    {
        type    zeroGradient;
    }
    outlet
    {
        type    zeroGradient;
    }
    wall
    {
        type    zeroGradient;
    }
}

// ************************************************************************* //
