run/labReactor/labReactor/system/surfaceSumFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates (weighted) sum over a surface

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patchValue.cfg"

#include "$FOAM_CASE/system/functionObject.cfg"

operation       sum;

// ************************************************************************* //
