run/labReactor/labReactor/system/topoSetSetsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name           solids_loading; // to be used in calcVolumeOfSet
        type           cellSet;
        action         new;

        source         boxToCell;
        sourceInfo
        {
            box ( -0.012 -0.000001 -0.012  )  ( 0.012 0.040001 0.012 );
        }
    }

    {
        name           bed_bottom;
        type           cellSet;
        action         new;

        source         boxToCell;
        sourceInfo
        {
            box ( -0.012 -0.000001 -0.012  )  ( 0.012 0.005001 0.012 );
        }
    }

    {
        name           bed_top;
        type           cellSet;
        action         new;

        source         boxToCell;
        sourceInfo
        {
            box ( -0.012 0.005001 -0.012  )  ( 0.012 0.010001 0.012 );
        }
    }

);

// ************************************************************************* //
