run/labReactor/labReactor/system/volIntegrateFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/volFieldValue/volIntegrate.cfg"

#include "$FOAM_CASE/system/functionObject.cfg"

operation       volIntegrate;

// ************************************************************************* //